
export const DSMSkalaZeniSkolotaji611 = {
  graphName: "(Zēniem) Bērna uzvedības novērtēšanas aptaujas skolotājiem(CBCL/6-11) DSM-orientēto skalu profila lapa zēniem",
  "afeRange": {
    name: "Afektīvie traucējumi",
    questionIndices: [5, 14, 18, 35, 52, 54, 60, 91, 102, 103],
    tValueMapping: {
      0: 50, 1: 50, 2: 55, 3: 58, 4: 60, 5: 62, 6: 64, 7: 69, 8: 71, 9: 73, 10: 76, 11: 78, 12: 81, 13: 83, 14: 85, 15: 87, 16: 90, 17: 92, 18: 95, 19: 98, 20: 100
    }
  },

  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [11, 29, 30, 45, 50, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 54, 3: 58, 4: 60, 5: 63, 6: 65, 7: 70, 8: 76, 9: 83, 10: 88, 11: 94, 12: 100
    }
  },
  "somaRange": {
    name: "Somatiskas problēmas",
    questionIndices: [-1],
    tValueMapping: {
      0: 50, 1: 59, 2: 63, 3: 68, 4: 69, 5: 71, 6: 75, 7: 78, 8: 81, 9: 84, 10: 87, 11: 90, 12: 93, 13: 97, 14: 100
    }
  },

  "uzmaRange": {
    name: "Uzmanības deficīts/hiperaktivitāte",
    questionIndices: [4, 8, 22, 78, 100, 10, 15, 24, 41, 53, 67, 93, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 6: 50, 7: 52, 8: 53, 9: 54, 10: 56, 11: 57, 12: 58, 13: 60, 14: 60, 15: 61, 16: 63, 17: 64, 18: 64, 19: 65, 20: 67, 21: 68, 22: 68, 23: 69, 24: 69, 25: 70, 26: 100
    }
  },


  "uzmanenotRange": {
    name: "Uzmanības nenoturība",
    questionIndices: [4, 8, 22, 78, 100],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 53, 5: 57, 6: 60, 7: 63, 8: 65, 9: 67, 10: 100
    }
  },

  "hiperRange": {
    name: "Hiperaktivitāte/impulsivitāte",
    questionIndices: [10, 15, 24, 41, 53, 67, 93, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 52, 5: 54, 6: 56, 7: 57, 8: 60, 9: 61, 10: 62, 11: 65, 12: 66, 13: 67, 14: 68, 15: 69, 16: 100
    }
  },

  "opozRange": {
    name: "Opozicionāti izaicinoši traucējumi",
    questionIndices: [3, 6, 23, 86, 95],
    tValueMapping: {
      0: 50, 1: 50, 2: 53, 3: 55, 4: 58, 5: 60, 6: 62, 7: 64, 8: 68, 9: 70, 10: 100
    }
  },

  "uzvedRange": {
    name: "Uzvedības traucējumi",
    questionIndices: [16, 21, 26, 28, 37, 39, 43, 57, 73, 82, 90, 97, 101],
    tValueMapping: {
      0: 50, 1: 50, 2: 52, 3: 54, 4: 56, 5: 57, 6: 58, 7: 59, 8: 59, 9: 60, 10: 62, 11: 63, 12: 64, 13: 65, 14: 65, 15: 66, 16: 68, 17: 69, 18: 71, 19: 74, 20: 78, 21: 81, 22: 85, 23: 88, 24: 92, 25: 96, 26: 100
    }
  },
}


export const SindromuSkalaZeniSkolotaji611 = {
  graphName: "(Zēniem) Bērna uzvedības novērtēšanas aptaujas skolotājiem (CBL/6-11) sindroma skalu profila lapa zēniem",
  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [14, 29, 30, 31, 32, 33, 35, 45, 50, 52, 71, 81, 91, 106, 108, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 52, 4: 54, 5: 56, 6: 58, 7: 59, 8: 61, 9: 62, 10: 64, 11: 65, 12: 65, 13: 67, 14: 68, 15: 69, 16: 70, 17: 72, 18: 74, 19: 76, 20: 78, 21: 80, 22: 82, 23: 84, 24: 85, 25: 87, 26: 89, 27: 91, 28: 92, 29: 94, 30: 96, 31: 98, 32: 100
    }
  },

  "nosRange": {
    name: "Noslēgšanās sevī/nomāktība",
    questionIndices: [5, 42, 65, 69, 75, 102, 103, 111],
    tValueMapping: {
      0: 50, 1: 50, 2: 54, 3: 56, 4: 58, 5: 60, 6: 63, 7: 64, 8: 65, 9: 69, 10: 71, 11: 76, 12: 81, 13: 86, 14: 90, 15: 95, 16: 100
    }
  },
  "somRange": {
    name: "Somatiskas problēmas",
    questionIndices: [51, 54, -1],
    tValueMapping: {
      0: 50, 1: 56, 2: 60, 3: 65, 4: 68, 5: 69, 6: 70, 7: 72, 8: 74, 9: 77, 10: 79, 11: 81, 12: 84, 13: 86, 14: 88, 15: 91, 16: 94, 17: 97, 18: 100
    }
  },

  "attRange": {
    name: "Attiecību problēmas",
    questionIndices: [11, 12, 25, 27, 34, 36, 38, 48, 62, 64, 79],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 54, 4: 56, 5: 58, 6: 60, 7: 62, 8: 63, 9: 65, 10: 67, 11: 68, 12: 69, 13: 70, 14: 73, 15: 77, 16: 80, 17: 84, 18: 87, 19: 90, 20: 94, 21: 97, 22: 100
    }
  },


  "netRange": {
    name: "Netipiska domāšana",
    questionIndices: [9, 18, 40, 46, 58, 66, 70, 83, 84, 85],
    tValueMapping: {
      0: 50, 1: 56, 2: 60, 3: 62, 4: 64, 5: 65, 6: 66, 7: 68, 8: 71, 9: 73, 10: 75, 11: 78, 12: 80, 13: 82, 14: 85, 15: 87, 16: 90, 17: 92, 18: 95, 19: 97, 20: 100
    }
  },

  "uzmRange": {
    name: "Uzmanības problēmas",
    questionIndices: [1, 4, 8, 13, 17, 22, 49, 60, 61, 72, 78, 80, 92, 100, 2, 7, 10, 15, 24, 41, 53, 67, 73, 74, 93, 109],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 6: 50, 7: 50, 8: 50, 9: 50, 10: 50, 11: 50,
      12: 51, 13: 52, 14: 54, 15: 54, 16: 55, 17: 57, 18: 58, 19: 58, 20: 59, 21: 59, 22: 60,
      23: 61, 24: 61, 25: 62, 26: 62, 27: 62, 28: 63, 29: 63, 30: 64, 31: 65, 32: 65, 33: 65,
      34: 65, 35: 66, 36: 66, 37: 67, 38: 68, 39: 68, 40: 69, 41: 69, 42: 71, 43: 74, 44: 77,
      45: 80, 46: 83, 47: 86, 48: 89, 49: 92, 50: 95, 51: 98, 52: 100
    }
  },

  "notRange": {
    name: "Noteikumu pārkāpumi",
    questionIndices: [26, 28, 39, 43, 63, 82, 90, 96, 98, 99, 101, 105],
    tValueMapping: {
      0: 50, 1: 50, 7: 65, 8: 65, 2: 54, 3: 57, 4: 58, 5: 60, 6: 63, 9: 66, 10: 68, 11: 69, 12: 71, 13: 74, 14: 76, 15: 79, 16: 81, 17: 83, 18: 85, 19: 88, 20: 90, 21: 92, 22: 94, 23: 97, 24: 100
    }
  },

  "agrRange": {
    name: "Agresīva uzvedība",
    questionIndices: [3, 6, 16, 19, 20, 21, 23, 37, 57, 68, 76, 77, 86, 87, 88, 89, 94, 95, 97, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 6: 54, 7: 54, 9: 57, 10: 57, 11: 57, 12: 58, 13: 58, 14: 59, 15: 59, 20: 64, 21: 64, 22: 65, 23: 65, 26: 68, 27: 68, 4: 51, 5: 53, 8: 55, 16: 60, 17: 61, 18: 62, 19: 63, 24: 66, 25: 67, 28: 69, 29: 70, 30: 72, 31: 75, 32: 77, 33: 80, 34: 82, 35: 85, 36: 88, 37: 91, 38: 94, 39: 97, 40: 100
    }
  },
}
