
export const DSMSkalaZeni611 = {
  graphName: "(Zēniem) Bērna uzvedības novērtēšanas aptaujas vecākiem(CBCL/6-11) DSM-orientēto skalu profila lapa zēniem",
  "afeRange": {
    name: "Afektīvie traucējumi",
    questionIndices: [5, 14, 18, 24, 35, 52, 54, 76, 77, 91, 100, 102, 103],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 53, 4: 57, 5: 60, 6: 64, 7: 65, 8: 69, 9: 76, 10: 77, 11: 78, 12: 80, 13: 81, 14: 83, 15: 84, 16: 86, 17: 87, 18: 89, 19: 90, 20: 92, 21: 93, 22: 95, 23: 96, 24: 97, 25: 98, 26: 100
    }
  },

  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [11, 29, 30, 45, 50, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 55, 4: 58, 5: 60, 6: 68, 7: 71, 8: 76, 9: 82, 10: 88, 11: 94, 12: 100
    }
  },
  "somaRange": {
    name: "Somatiskas problēmas",
    questionIndices: [-1],
    tValueMapping: {
      0: 50, 1: 50, 2: 56, 3: 60, 4: 68, 5: 76, 6: 78, 7: 80, 8: 83, 9: 86, 10: 88, 11: 91, 12: 94, 13: 97, 14: 100
    }
  },

  "uzmaRange": {
    name: "Uzmanības deficīts/hiperaktivitāte",
    questionIndices: [4, 8, 10, 41, 78, 93, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 6: 53, 7: 55, 8: 58, 9: 60, 10: 63, 11: 65, 12: 70, 13: 85, 14: 100
    }
  },

  "opozRange": {
    name: "Opozicionāti izaicinoši traucējumi",
    questionIndices: [3, 22, 23, 86, 95],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 52, 5: 55, 6: 59, 7: 64, 8: 68, 9: 72, 10: 100
    }
  },

  "uzvedRange": {
    name: "Uzvedības traucējumi",
    questionIndices: [15, 16, 21, 26, 28, 37, 39, 43, 57, 67, 72, 81, 82, 90, 97, 101, 106],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 11: 67, 12: 67, 4: 54, 5: 56, 6: 58, 7: 60, 8: 62, 9: 64, 10: 66, 13: 68, 14: 69, 15: 70, 16: 72, 17: 74, 18: 75, 19: 77, 20: 78, 21: 80, 22: 81, 23: 83, 24: 84, 25: 86, 26: 87, 27: 89, 28: 90, 29: 92, 30: 93, 31: 95, 32: 96, 33: 98, 34: 100
    }
  },
}

export const SindromuSkalaZeni611 = {
  graphName: "(Zēniem) Bērna uzvedības novērtēšanas aptaujas vecākiem (CBL/6-11) sindroma skalu profila lapa zēniem",
  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [14, 29, 30, 31, 32, 33, 35, 45, 50, 52, 71, 91, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 54, 6: 56, 7: 58, 8: 60, 9: 62, 10: 65, 11: 67, 12: 69, 13: 70, 14: 72, 15: 75, 16: 77, 17: 79, 18: 81, 19: 83, 20: 85, 21: 87, 22: 89, 23: 92, 24: 95, 25: 97, 26: 100
    }
  },

  "nosRange": {
    name: "Noslēgšanās sevī/nomāktība",
    questionIndices: [5, 42, 65, 69, 75, 102, 103, 111],
    tValueMapping: {
      0: 50, 1: 50, 2: 53, 3: 57, 4: 60, 5: 64, 6: 67, 7: 70, 8: 74, 9: 77, 10: 80, 11: 83, 12: 86, 13: 89, 14: 92, 15: 96, 16: 100
    }
  },
  "somRange": {
    name: "Somatiskas problēmas",
    questionIndices: [47, 49, 51, 54, -1],
    tValueMapping: {
      0: 50, 1: 50, 2: 53, 3: 57, 4: 60, 5: 64, 6: 69, 7: 74, 8: 77, 9: 79, 10: 80, 11: 82, 12: 83, 13: 85, 14: 86, 15: 88, 16: 89, 17: 91, 18: 92, 19: 95, 20: 96, 21: 98, 22: 100
    }
  },

  "attRange": {
    name: "Attiecību problēmas",
    questionIndices: [11, 12, 25, 27, 34, 36, 38, 48, 62, 64, 79],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 54, 5: 57, 6: 60, 7: 62, 8: 64, 9: 65, 10: 66, 11: 67, 12: 68, 13: 69, 14: 71, 15: 74, 16: 78, 17: 81, 18: 85, 19: 88, 20: 92, 21: 96, 22: 100
    }
  },


  "netRange": {
    name: "Netipiska domāšana",
    questionIndices: [9, 18, 40, 46, 58, 59, 60, 66, 70, 76, 83, 84, 85, 92, 100],
    tValueMapping: {
      0: 50, 1: 50, 2: 53, 3: 57, 4: 60, 5: 65, 6: 66, 7: 70, 8: 74, 9: 75, 10: 76, 11: 77, 12: 78, 13: 80, 14: 81, 15: 82, 16: 83, 17: 84, 18: 86, 19: 87, 20: 88, 21: 89, 22: 90, 23: 92, 24: 93, 25: 94, 26: 95, 27: 96, 28: 97, 29: 98, 30: 100
    }
  },

  "uzmRange": {
    name: "Uzmanības problēmas",
    questionIndices: [1, 4, 8, 10, 13, 17, 41, 61, 78, 80],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 6: 50, 7: 54, 8: 55, 9: 58, 10: 60, 11: 61, 12: 63, 13: 65, 14: 68, 15: 70, 16: 76, 17: 82, 18: 88, 19: 94, 20: 100
    }
  },

  "notRange": {
    name: "Noteikumu pārkāpumi",
    questionIndices: [2, 26, 28, 39, 43, 63, 67, 72, 73, 81, 82, 90, 96, 99, 101, 105, 106],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 53, 4: 56, 5: 58, 6: 60, 7: 64, 8: 65, 9: 67, 10: 68, 11: 69, 12: 70, 13: 72, 14: 74, 15: 75, 16: 76, 17: 78, 18: 79, 19: 81, 20: 82, 21: 83, 22: 84, 23: 86, 24: 87, 25: 88, 26: 90, 27: 91, 28: 92, 29: 93, 30: 95, 31: 96, 32: 97, 33: 98, 34: 100
    }
  },

  "agrRange": {
    name: "Agresīva uzvedība",
    questionIndices: [3, 16, 19, 20, 21, 22, 23, 37, 57, 68, 86, 87, 88, 89, 94, 95, 97, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 6: 50, 7: 52, 8: 52, 20: 68, 21: 68, 22: 69, 23: 69, 9: 53, 10: 54, 11: 55, 12: 56, 13: 57, 14: 59, 15: 60, 16: 62, 17: 64, 18: 65, 19: 67, 24: 70, 25: 72, 26: 75, 27: 77, 28: 80, 29: 82, 30: 85, 31: 88, 32: 91, 33: 93, 34: 96, 35: 98, 36: 100
    }
  },
}

export const DSMSkalaMeitenes611 = {
  graphName: "(Meitenēm) Bērna uzvedības novērtēšanas aptaujas vecākiem(CBCL/6-11) DSM-orientēto skalu profila lapa",
  "afeRange": {
    name: "Afektīvie traucējumi",
    questionIndices: [5, 14, 18, 24, 35, 52, 54, 76, 77, 91, 100, 102, 103],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 56, 4: 58, 5: 60, 6: 64, 7: 66, 8: 70, 9: 72, 10: 73, 11: 75, 12: 76, 13: 78, 14: 79, 15: 81, 16: 83, 17: 84, 18: 86, 19: 87, 20: 89, 21: 91, 22: 93, 23: 94, 24: 96, 25: 98, 26: 100
    }
  },

  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [11, 29, 30, 45, 50, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 54, 4: 57, 5: 60, 6: 63, 7: 65, 8: 70, 9: 72, 10: 88, 11: 94, 12: 100
    }
  },
  "somaRange": {
    name: "Somatiskas problēmas",
    questionIndices: [-1],
    tValueMapping: {
      0: 50, 1: 50, 2: 55, 3: 59, 4: 64, 5: 70, 6: 74, 7: 77, 8: 80, 9: 83, 10: 87, 11: 90, 12: 93, 13: 96, 14: 100
    }
  },

  "uzmaRange": {
    name: "Uzmanības deficīts/hiperaktivitāte",
    questionIndices: [4, 8, 10, 41, 78, 93, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 53, 5: 55, 6: 59, 7: 63, 8: 65, 9: 67, 10: 69, 11: 71, 12: 81, 13: 90, 14: 100
    }
  },

  "opozRange": {
    name: "Opozicionāti izaicinoši traucējumi",
    questionIndices: [3, 22, 23, 86, 95],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 59, 5: 64, 6: 66, 7: 67, 8: 68, 9: 70, 10: 100
    }
  },

  "uzvedRange": {
    name: "Uzvedības traucējumi",
    questionIndices: [15, 16, 21, 26, 28, 37, 39, 43, 57, 67, 72, 81, 82, 90, 97, 101, 106],
    tValueMapping: {
      0: 50, 1: 50, 2: 54, 3: 59, 4: 63, 5: 65, 6: 66, 7: 67, 8: 68, 9: 69, 10: 70, 11: 72, 12: 73, 13: 74, 14: 76, 15: 77, 16: 78, 17: 79, 18: 80, 19: 82, 20: 83, 21: 84, 22: 85, 23: 86, 24: 88, 25: 89, 26: 90, 27: 91, 28: 92, 29: 94, 30: 95, 31: 96, 32: 97, 33: 98, 34: 100
    }
  },
}

export const SindromuSkalaMeitenes611 = {
  graphName: "(Meitenēm) Bērna uzvedības novērtēšanas aptaujas vecākiem (CBL/6-11) sindroma skalu profila lapa meitenēm",
  "traukRange": {
    name: "Trauksmes traucējumi",
    questionIndices: [14, 29, 30, 31, 32, 33, 35, 45, 50, 52, 71, 91, 112],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 52, 5: 54, 6: 56, 7: 58, 8: 60, 9: 61, 10: 63, 11: 66, 12: 68, 13: 70, 14: 73, 15: 76, 16: 78, 17: 80, 18: 82, 19: 84, 20: 86, 21: 88, 22: 90, 23: 92, 24: 95, 25: 97, 26: 100
    }
  },

  "nosRange": {
    name: "Noslēgšanās sevī/nomāktība",
    questionIndices: [5, 42, 65, 69, 75, 102, 103, 111],
    tValueMapping: {
      0: 50, 1: 50, 2: 55, 3: 60, 4: 63, 5: 66, 6: 68, 7: 70, 8: 73, 9: 76, 10: 79, 11: 82, 12: 85, 13: 88, 14: 92, 15: 96, 16: 100
    }
  },
  "somRange": {
    name: "Somatiskas problēmas",
    questionIndices: [47, 49, 51, 54, -1],
    tValueMapping: {
      0: 50, 1: 50, 2: 53, 3: 56, 4: 60, 5: 64, 6: 68, 7: 71, 8: 74, 9: 76, 10: 78, 11: 80, 12: 82, 13: 84, 14: 86, 15: 88, 16: 90, 17: 92, 18: 94, 19: 96, 20: 98, 21: 99, 22: 100
    }
  },

  "attRange": {
    name: "Attiecību problēmas",
    questionIndices: [11, 12, 25, 27, 34, 36, 38, 48, 62, 64, 79],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 54, 4: 59, 5: 61, 6: 63, 7: 65, 8: 68, 9: 69, 10: 71, 11: 74, 12: 76, 13: 79, 14: 81, 15: 83, 16: 85, 17: 88, 18: 90, 19: 92, 20: 95, 21: 98, 22: 100
    }
  },


  "netRange": {
    name: "Netipiska domāšana",
    questionIndices: [9, 18, 40, 46, 58, 59, 60, 66, 70, 76, 83, 84, 85, 92, 100],
    tValueMapping: {
      0: 50, 1: 50, 2: 55, 3: 60, 4: 65, 5: 68, 6: 70, 7: 72, 8: 73, 9: 74, 10: 75, 11: 77, 12: 78, 13: 79, 14: 80, 15: 81, 16: 83, 17: 84, 18: 85, 19: 86, 20: 87, 21: 89, 22: 90, 23: 91, 24: 92, 25: 93, 26: 95, 27: 96, 28: 97, 29: 98, 30: 100
    }
  },

  "uzmRange": {
    name: "Uzmanības problēmas",
    questionIndices: [1, 4, 8, 10, 13, 17, 41, 61, 78, 80],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 53, 6: 57, 7: 60, 8: 62, 9: 64, 10: 67, 11: 71, 12: 75, 13: 78, 14: 81, 15: 84, 16: 87, 17: 90, 18: 93, 19: 96, 20: 100
    }
  },

  "notRange": {
    name: "Noteikumu pārkāpumi",
    questionIndices: [2, 26, 28, 39, 43, 63, 67, 72, 73, 81, 82, 90, 96, 99, 101, 105, 106],
    tValueMapping: {
      0: 50, 1: 50, 2: 54, 3: 59, 4: 63, 5: 65, 6: 70, 7: 71, 8: 72, 9: 73, 10: 74, 11: 75, 12: 76, 13: 77, 14: 78, 15: 79, 16: 80, 17: 81, 18: 82, 19: 83, 20: 85, 21: 86, 22: 87, 23: 88, 24: 89, 25: 90, 26: 91, 27: 92, 28: 93, 29: 94, 30: 95, 31: 96, 32: 97, 33: 98, 33: 100
    }
  },

  "agrRange": {
    name: "Agresīva uzvedība",
    questionIndices: [3, 16, 19, 20, 21, 22, 23, 37, 57, 68, 86, 87, 88, 89, 94, 95, 97, 104],
    tValueMapping: {
      0: 50, 1: 50, 2: 50, 3: 50, 4: 50, 5: 50, 12: 67, 13: 67, 14: 68, 15: 68, 16: 68, 17: 68, 18: 69, 19: 69, 6: 53, 7: 55, 8: 57, 9: 59, 10: 62, 11: 65, 20: 70, 21: 71, 22: 73, 23: 75, 24: 77, 25: 79, 26: 81, 27: 83, 28: 85, 29: 87, 30: 89, 31: 91, 32: 93, 33: 94, 34: 96, 35: 98, 36: 100
    }
  },
}
